Ahmedalaalotfy/Embedded_system_online_diploma/unit8_MCU_Interfacing/unit8_lesson7_I2C_STM32/Drivers/Src/main.c
/**
 **************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 **************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 **************************
 */

#if !defined(_SOFT_FP) && defined(_ARM_FP)
#warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

//#define MCU_Act_As_Master
#define MCU_Act_As_Slave

#include "Stm32_F103C6_GPIO_Driver.h"
#include "stm32f103x6.h"
#include "Stm32_F103C6_EXTI_Driver.h"
#include "Stm32_F103C6_USART_Driver.h"
#include "Stm32_F103C6_SPI_Driver.h"
#include "Stm32_F103C6_I2C_Driver.h"
#include "I2C_Slave_EEPROM.h"

unsigned char ch ;

void clock_init()
{
	//Enable clock GPIOA
	RCC_GPIOA_CLK_EN() ;

	//Enable clock GPIOB
	RCC_GPIOB_CLK_EN() ;

	//Enable clock AFIO
	AFIO_GPIOE_CLK_EN() ;

}


void wait (int x)
{
	unsigned int i , j ;
	for (i= 0 ; i<x ; i++)
		for (j= 0 ; j<255 ; j++);
}

int main(void)
{

	clock_init();

	//Test case 1
	uint8_t ch1[] = {0x1,0x2,0x3,0x4,0x5,0x6,0x7};
	uint8_t ch2[7] = {0};

	EEPROM_Init();
	EEPROM_Write_Nbytes(0xAF, ch1, 7);
	EEPROM_Read_byte(0xAF, ch2, 7);


	//Test case 2
	ch1[0] = 0xA;
	ch1[1] = 0xB;
	ch1[2] = 0xC;
	ch1[3] = 0xD;

	EEPROM_Write_Nbytes(0xFFF,ch1, 4) ;
	EEPROM_Read_byte(0xFFF, ch2, 4);

	while (1)
	{

	}

}
